
/**
  ******************************************************************************
  * @file           : qulitycounter.c
  * @brief          : qulity counter
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 hopewellgroup.
  * All rights reserved.
  *
  * This software is licensed by hopewellgroup under Ultimate Liberty license
  *
  ******************************************************************************
  */

#include "qulitycounter.h"

static QtCnt qt_cnt;

/*******************************************************************************
函数名称：collect_clear_qt_cnt
功    能：清空当前的质检计数值
说    明：
参    数:
返    回: 
注    意：
*******************************************************************************/
void collect_clear_qt_cnt(void)
{
	qt_cnt.qtcnt = 0;
}

/*******************************************************************************
函数名称：collect_set_qt_intcnt
功    能：统计质检的次数
说    明：
参    数:
返    回: 
注    意：
*******************************************************************************/
void collect_set_qt_intcnt(void)
{
	qt_cnt.qtcnt++;
}

/*******************************************************************************
函数名称：collect_get_qt_cnt
功    能：获取质检的次数
说    明：
参    数:
返    回: 
注    意：
*******************************************************************************/
U32 collect_get_qt_cnt(void)
{
	return qt_cnt.qtcnt;
}

/************************ (C) COPYRIGHT Hopewellgroup ***********END OF FILE***/

